In [12]:
import pandas as pd

In [13]:
student_df = pd.read_csv("new_student_data.csv")

In [14]:
#returns the first or last 5 values in this df 
student_df.head()
#student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [16]:
#returns the first 5 values from the student id column! 
student_df["student_id"].head()

0    127008367
1     33365505
2     44359500
3     24791243
4    121467881
Name: student_id, dtype: int64

In [22]:
#this will return how much missing data we have AND in which columns too or for the mean call what % of data is missing
#student_df.isnull().sum()
student_df.isnull().mean()*100

student_id        0.000000
student_name      0.000000
grade             0.000000
school_name       0.000000
reading_score    10.143472
math_score        5.057389
school_type       0.000000
dtype: float64

In [23]:
#example for dealing with missing data

import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})

In [99]:
daily_returns.isna().sum()

AAPL    1
GOOG    0
dtype: int64

In [25]:
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
2  0.62  0.55

In [27]:
daily_returns.fillna("Unknown")

      AAPL  GOOG
0      0.5  0.45
1  Unknown  0.63
2     0.62  0.55

In [28]:
daily_returns.fillna(0)

   AAPL  GOOG
0  0.50  0.45
1  0.00  0.63
2  0.62  0.55

In [32]:
#returns 0.56 which is the average of 0.5 and 0.62
daily_returns.fillna(daily_returns["AAPL"].mean())

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [33]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

     Best Actors
0       Nic Cage
1       Nic Cage
2  Harrison Ford

In [36]:
#returns True at row 1 
best_actors_df.duplicated()

0    False
1     True
2    False
dtype: bool

In [37]:
best_actors_df.drop_duplicates()

     Best Actors
0       Nic Cage
2  Harrison Ford

In [84]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})
prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [85]:
#returns $0.22 twice...so need it to not be a string, dtypes returns object, meaning string, so can't do math on it
prices.dtypes
#prices["price_usd"][1]*2

price_usd    object
dtype: object

In [86]:
prices.loc[0:,"price_usd"] = prices.loc[0:,"price_usd"].str.replace("$" , "")
#so no longer dollar signs infront here, but the data type is still an object! So use .astype()
prices.dtypes

/var/folders/9m/xp265wv97bl6mhlqzr9f1wcr0000gn/T/ipykernel_68652/822049967.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  prices.loc[0:,"price_usd"] = prices.loc[0:,"price_usd"].str.replace("$" , "")

price_usd    object
dtype: object

In [94]:
prices.loc[0:, "price_usd"] = prices.loc[0:, "price_usd"].astype("float")

In [96]:
#now it will return 0.44!!!! 
prices["price_usd"][1]*2

0.44

In [104]:
student_df = student_df.dropna()

In [113]:
student_df = student_df.drop_duplicates()
#student_df.duplicated().sum() will return 0

0

In [114]:
student_df.dtypes
#returns that grade is an object

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [116]:
student_df["grade"].head()
#this column has 11th rather than 11 by itself so lets get rid of the th

0    11th
2    12th
3    11th
4    12th
5     9th
Name: grade, dtype: object

In [118]:
student_df.loc[:,"grade"] = student_df.loc[:,"grade"].str.replace("th" , "")

In [120]:
#grade is still an object so lets convert it to an integer 
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [121]:
student_df.loc[:,"grade"] = student_df.loc[:,"grade"].astype("int")

/var/folders/9m/xp265wv97bl6mhlqzr9f1wcr0000gn/T/ipykernel_68652/4256893749.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  student_df.loc[:,"grade"] = student_df.loc[:,"grade"].astype("int")

In [126]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [128]:
sales_df["total_price"].describe()

count     5.000000
mean     37.688000
std      17.128761
min       8.460000
25%      39.520000
50%      40.200000
75%      50.010000
max      50.250000
Name: total_price, dtype: float64

In [129]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [135]:
student_df.columns

Index(['student_id', 'student_name', 'grade', 'school_name', 'reading_score',
       'math_score', 'school_type'],
      dtype='object')

In [136]:
#student_df.describe()
student_df.mean()

/var/folders/9m/xp265wv97bl6mhlqzr9f1wcr0000gn/T/ipykernel_68652/1515950957.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  student_df.mean()

student_id       6.971953e+07
grade            1.056601e+01
reading_score    7.524151e+01
math_score       6.434325e+01
dtype: float64

In [150]:
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc
#aapl_returns.iloc[0]

#select a range using iloc
aapl_returns.iloc[1:3]

   AAPL
1  0.56
2  0.59

In [165]:
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])

In [167]:
revenue_df.loc['2018-10-01':'2019-03-31', "revenue"].describe()

count    182.000000
mean     519.719780
std      297.825923
min        6.000000
25%      254.000000
50%      504.500000
75%      799.750000
max      996.000000
Name: revenue, dtype: float64

In [168]:
sales_df

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [176]:
sales_df.loc[(sales_df["quantity"] > 10) & (sales_df["total_price"] < 45)]

       item  quantity  total_price
1    onions        26        39.52
3  tomatoes        12        40.20

In [177]:
min_price = sales_df["total_price"].min()

In [178]:
min_price

8.46

In [179]:
min_price_row = sales_df.loc[sales_df["total_price"] == min_price]

In [180]:
min_price_row

        item  quantity  total_price
4  mushrooms         2         8.46

In [182]:
sales_df.loc[sales_df["item"] == "tomatoes"]

       item  quantity  total_price
0  tomatoes        15        50.25
3  tomatoes        12        40.20

In [186]:
#returns the mean of the 2 rows with tomatoes as the item 
sales_df.loc[sales_df["item"] == "tomatoes" , ["total_price"]].mean()

total_price    45.225
dtype: float64

In [191]:
#this will return rows at index position 0 and 3 and columns 0 and 2, (rows, columns)
sales_df.iloc[[0,3] , [0,2]]

       item  total_price
0  tomatoes        50.25
3  tomatoes        40.20

In [195]:
sales_df.iloc[[0,2],:]

       item  quantity  total_price
0  tomatoes        15        50.25
2  potatoes        10        50.01

In [199]:
#ascending is default, set to False to get descending 
sales_df.sort_values("total_price" , ascending = False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [206]:
student_df.iloc[:10].sort_values("school_name")

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
8,67245222,Tina Roberts,12,Bowers High School,87.5,81.5,Public
2,44359500,Ryan Haas,12,Campbell High School,91.6,54.7,Public
0,127008367,Sarah Douglas,11,Chang High School,87.2,64.1,Public
4,121467881,Harold Reynolds,12,Chang High School,68.7,43.4,Public
10,67723113,Jeffrey Smith,9,Chang High School,84.4,83.8,Public
7,52477762,Tracy Flores,9,Fisher High School,72.0,67.3,Public
3,24791243,Kathryn Mack,11,Richard High School,68.9,73.3,Charter
9,101335836,Shane Smith,9,Silva High School,63.2,79.1,Public
5,79397676,Kyle Brooks,9,Turner High School,72.6,55.4,Public
11,127402895,Samuel Williams,11,Turner High School,91.6,54.9,Public

In [207]:
public_schools_df = student_df.loc[student_df["school_type"] == "Public"]

In [209]:
public_schools_df.describe()

         student_id        grade  reading_score   math_score
count  9.371000e+03  9371.000000    9371.000000  9371.000000
mean   6.974398e+07    10.538043      75.708078    64.697727
std    3.471334e+07     1.138498      14.112392    16.885912
min    1.000132e+07     9.000000      11.400000     1.400000
25%    3.965142e+07     9.000000      66.500000    53.000000
50%    7.018066e+07    11.000000      76.900000    65.500000
75%    9.984795e+07    12.000000      86.700000    77.100000
max    1.299903e+08    12.000000     100.000000   100.000000

In [210]:
charter_schools_df = student_df.loc[student_df["school_type"] == "Charter"]

In [212]:
charter_schools_df.describe()

         student_id        grade  reading_score   math_score
count  1.233000e+03  1233.000000    1233.000000  1233.000000
mean   6.953366e+07    10.778589      71.695539    61.649148
std    3.468531e+07     1.029025      15.066829    14.580061
min    1.002379e+07     9.000000       9.500000    16.900000
25%    4.039925e+07    10.000000      61.600000    51.200000
50%    6.871485e+07    11.000000      72.300000    62.200000
75%    9.979185e+07    12.000000      83.400000    72.100000
max    1.297629e+08    12.000000      99.900000   100.000000

In [215]:
min_math_score = student_df["math_score"].min()

In [216]:
min_math_score

1.4

In [217]:
min_math_score_row = student_df.loc[student_df["math_score"]== min_math_score]

In [218]:
min_math_score_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
6772,10439629,Kevin Davis,11,Green High School,68.1,1.4,Public

In [226]:
student_df.loc[student_df["school_name"] == "Green High School" , "math_score"].mean()

58.970238095238095

In [227]:
student_df.loc[student_df["math_score"] < 70]

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11,Chang High School,87.2,64.1,Public
2,44359500,Ryan Haas,12,Campbell High School,91.6,54.7,Public
4,121467881,Harold Reynolds,12,Chang High School,68.7,43.4,Public
5,79397676,Kyle Brooks,9,Turner High School,72.6,55.4,Public
7,52477762,Tracy Flores,9,Fisher High School,72.0,67.3,Public
...,...,...,...,...,...,...,...
13923,60616803,Sheryl Clarke,11,Fisher High School,84.6,43.7,Public
13924,56287453,Maria Powell,10,Richard High School,65.6,67.6,Charter
13929,128983164,Jeffery Moore,10,Campbell High School,96.5,48.1,Public
13932,126977198,Cindy Thomas,9,Fisher High School,89.1,61.1,Public
13935,32277979,Kelly Myers,10,Sullivan High School,62.3,37.9,Public

In [228]:
sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions", "tomatoes"],
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

# a column we want to use for grouping should contain repeated values, for example the item or store column above@!!

In [229]:
item_grouping = sales_df.groupby("item")

In [230]:
item_grouping

In [238]:
item_grouping.mean()

/var/folders/9m/xp265wv97bl6mhlqzr9f1wcr0000gn/T/ipykernel_68652/462999870.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  item_grouping.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [240]:
item_and_store_grouping = sales_df.groupby(["item" , "store"])

In [242]:
item_and_store_grouping.sum()

                    quantity  total_price
item      store
mushrooms Downtown         2         8.46
onions    Downtown        43        65.36
          Midtown         20        30.40
potatoes  Midtown         13        65.13
tomatoes  Downtown        15        50.25
          Midtown         37       123.95

In [243]:
student_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11,Chang High School,87.2,64.1,Public
2,44359500,Ryan Haas,12,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12,Chang High School,68.7,43.4,Public
5,79397676,Kyle Brooks,9,Turner High School,72.6,55.4,Public
...,...,...,...,...,...,...,...
13935,32277979,Kelly Myers,10,Sullivan High School,62.3,37.9,Public
13936,109412748,Kimberly Burke,10,Montgomery High School,99.5,89.8,Public
13937,16856426,Crystal Merritt,9,Turner High School,86.3,71.1,Public
13938,88213835,Misty Wiggins,10,Fisher High School,75.4,76.4,Public
13939,12153644,Michele Jones,11,Chang High School,69.0,72.4,Public

In [248]:
avg_student_scores_by_grade = student_df.groupby("grade").mean()

/var/folders/9m/xp265wv97bl6mhlqzr9f1wcr0000gn/T/ipykernel_68652/1678683937.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avg_student_scores_by_grade = student_df.groupby("grade").mean()

In [249]:
avg_student_scores_by_grade.loc[:,["math_score" , "reading_score"]]

       math_score  reading_score
grade
9       68.821676      77.796027
10      65.993374      76.351070
11      61.401434      76.785772
12      61.804705      70.643235

In [255]:
min_scores_by_school = student_df.groupby("school_name").min()
min_scores_by_school.loc[:, ["math_score", "reading_score"]].sort_values("math_score")

                        math_score  reading_score
school_name
Green High School              1.4           40.0
Montgomery High School         5.6           27.3
Bowers High School             9.4           16.6
Turner High School             9.6           23.4
Campos High School            10.0           34.0
Fisher High School            11.0           11.4
Chang High School             15.1           33.8
Odonnell High School          16.5           24.4
Richard High School           16.9            9.5
Woods High School             16.9           19.9
Wagner High School            18.1           22.5
Campbell High School          18.3           30.8
Sullivan High School          23.0           29.9
Silva High School             24.5           28.0
Dixon High School             24.7           28.7

In [258]:
name_and_grade = student_df.groupby(["school_name" , "grade"]).mean()

/var/folders/9m/xp265wv97bl6mhlqzr9f1wcr0000gn/T/ipykernel_68652/2465476676.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  name_and_grade = student_df.groupby(["school_name" , "grade"]).mean()

In [261]:
name_and_grade.loc[:,["math_score" , "reading_score"]]

                              math_score  reading_score
school_name            grade
Bowers High School     9       56.534783      63.569565
                       10      68.614286      54.842857
                       11      68.064072      79.318563
                       12      57.414516      76.167742
Campbell High School   9       62.946452      82.093548
                       10      71.937363      84.320000
                       11      60.250000      74.606522
                       12      72.863158      78.269123
Campos High School     9       53.430579      78.045455
                       10      72.294771      78.133333
                       11      74.769811      71.717610
                       12      61.918692      76.108411
Chang High School      9       73.428758      77.488889
                       10      74.776923      80.384615
                       11      72.307234      83.495745
                       12      68.443873      62.273284
Dixon High School      9       42.933333      71.466667
                       10      72.900000      64.733333
                       11      66.432692      79.303846
                       12      57.112500      59.490000
Fisher High School     9       68.167473      78.423656
                       10      64.855008      77.884236
                       11      49.977091      71.963091
                       12      55.148917      79.664440
Green High School      9       68.807759      80.039655
                       10      65.611268      68.712676
                       11      59.259615      65.779808
                       12      51.257746      72.472300
Montgomery High School 9       68.228958      85.130502
                       10      55.851613      77.039355
                       11      62.853750      72.968750
                       12      59.781921      69.677401
Odonnell High School   9       78.393750      69.675000
                       10      74.369048      68.807143
                       11      59.073810      67.228571
                       12      58.335714      63.183333
Richard High School    9       50.852326      67.843605
                       10      53.814737      67.041754
                       11      61.798827      79.331965
                       12      73.511480      70.308157
Silva High School      9       70.381159      81.471014
                       10      76.554167      74.127083
                       11      73.212565      82.582723
                       12      74.552427      61.339806
Sullivan High School   9       54.600000      76.305556
                       10      53.416327      77.916327
                       11      53.762500      71.356250
                       12      60.461290      72.003226
Turner High School     9       76.776374      77.295742
                       10      68.037047      74.544041
                       11      57.217886      79.630407
                       12      52.550384      59.802302
Wagner High School     9       74.947000      75.595000
                       10      73.550000      79.750000
                       11      70.288889      69.874444
                       12      69.295652      79.786957
Woods High School      9       54.579167      69.535417
                       10      68.420000      71.240000
                       11      60.831250      85.009375
                       12      55.566667      81.490476